[
{
    "mainText":"Viking Moving and Relocation is a full service moving company based in Southern California and serving all of California along with dozens of other cities within the United States. Viking's business model is based on two quite simple yet infinitely important concepts: customer service and quality. Our goal and objective is to provide you with the absolute best, quickest and most efficient (and least stressful!) moving experience possible and in our years of business, we can honestly say that we have exceeded our goals! We are absolutely certain that once you have spoken with us and decide to entrust your moving needs to us, you will agree and join hundreds of others who we have had the good fortune to work for!"
},
{
"movingServices": "The majority of Viking's work is done in Southern California with Long Beach and the Greater Los Angeles area being our busiest area. And since Viking is a full-service moving company, we are happy to do moves anywhere from simple, one bedroom apartments to full, 4 bedroom family homes. Every week Viking performs literally dozens of single person and family relocations from Long Beach and the Los Angeles area to new places within that area and we can honestly say that we have never had a dissatisfied client!Every week Viking performs literally dozens of single person and family relocations from Long Beach and the Los Angeles area to new places within that area and we can honestly say that we have never had a dissatisfied client!"

},

{

    "piano": " Moving a piano is a highly specialized skill that requires both an intricate knowledge of how to properly disassemble and prepare the piano along with special equipment to both protect and move it. This is especially true of baby grand and grand pianos, but less so with most upright models.In many cases, the movers must know what NOT to do when preparing and moving the piano and this is where many discount piano movers go wrong! A piano that is improperly prepared can result in major damage, and one that is improperly moved or transported can result in serious injuries and major damage.Correctly moving a piano that normally weighs in excess of 500 pounds is much more that having multiple movers using sheer force. Rather, it is knowing how the piano is constructed, its heavy vs light areas, and how to use the leverage that these areas give the mover to efficiently move it. Along with a small crew of experienced piano movers, the owner of Viking is always the lead mover and always present in any piano move and has been involved in hundreds of piano moves, from the simple and straightforward to the complex and complicated! Viking is also pleased to offer long and short-term piano storage at our facility in Whittier, California."
}


]











